#### DefaultOpenFromCloudCallback Members

---

|  |
| --- |
| DefaultOpenFromCloudCallback Class   Constructors   Methods   Properties   See Also |

The  DefaultOpenFromCloudCallback  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DefaultOpenFromCloudCallback | Create a default open callback. Open latest by default for all scenarios. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  DefaultOpenFromCloudCallback |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | OnOpenConflict | A method called when the conflict is happen during the model opening. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

DefaultOpenFromCloudCallback Class

Autodesk.Revit.DB Namespace